<template>
  <h2 class="h2 mb-1.5">Важная информация</h2>
  <div class="text-flex">
    <p>
      С 1 июля 2021 года все компании и индивидуальные предприниматели,
      принимающие платежи, обязаны использовать онлайн-кассы. В связи с этим,
      каждый кассовый чек должен содержать определенные обязательные реквизиты
      для подтверждения подлинности транзакции, включая QR-код, который содержит
      закодированные данные для проверки.
    </p>
    <p>
      Обязательные реквизиты на бумажном кассовом чеке согласно требованиям
      №54-ФЗ:
    </p>
    <ol class="ol">
      <li>Тип документа (кассовый чек).</li>
      <li>Название организации или индивидуального предпринимателя.</li>
      <li>Номер чека в рамках текущей смены.</li>
      <li>Дата и время проведения расчета, а также адрес точки продаж.</li>
      <li>Система налогообложения, применяемая продавцом.</li>
      <li>Признак расчета (например, продажа или возврат).</li>
      <li>Перечень наименований товаров, работ или услуг и их количество.</li>
      <li>Стоимость единицы товара/услуги.</li>
      <li>Итоговая сумма чека, информация о НДС и налоговой ставке.</li>
      <li>Способ оплаты (наличные или безналичные).</li>
      <li>Регистрационный номер контрольно-кассовой техники (ККТ).</li>
      <li>Уникальный номер фискального накопителя.</li>
      <li>Фискальный признак документа (ФП или ФПД).</li>
      <li>Номер фискального документа (ФД).</li>
      <li>QR-код для проверки чека</li>
    </ol>
  </div>
</template>
