<template>
  <div class="container">
    <h2 class="h2 mb-3">Политика конфиденциальности и обработки данных</h2>
    <div class="text-flex">
      <div class="text-flex">
        <h3 class="h3">1. Общие положения</h3>
        <p>
          Настоящая Политика конфиденциальности (далее — «Политика») определяет
          порядок обработки и защиты персональных данных пользователей сервиса
          проверки чеков (далее — «Сервис»). Мы стремимся обеспечить
          безопасность предоставленных данных и соблюдение законодательства о
          защите персональной информации.
        </p>
        <p>
          Использование Сервиса означает согласие пользователя с данной
          Политикой. Если пользователь не согласен с условиями Политики, он
          должен прекратить использование Сервиса.
        </p>
      </div>
      <div class="text-flex">
        <h3 class="h3">2. Обрабатываемые данные</h3>
        <figure>
          <figcaption class="figcaption">
            При использовании Сервиса могут обрабатываться следующие данные:
          </figcaption>
          <ul class="ul">
            <li>
              Данные, предоставленные пользователем (например, номер фискального
              чека, дата и сумма покупки);
            </li>
            <li>
              Автоматически собираемая информация (IP-адрес, тип устройства,
              браузер, файлы cookie, информация о взаимодействии с Сервисом);
            </li>
            <li>
              Иная информация, предоставленная пользователем при обращении в
              службу поддержки.
            </li>
          </ul>
        </figure>
      </div>
      <div class="text-flex">
        <h3 class="h3">3. Цели обработки данных</h3>
        <figure>
          <figcaption class="figcaption">
            Обработка персональных данных осуществляется исключительно для:
          </figcaption>
          <ul class="ul">
            <li>Проверки корректности чека и отображения результатов;</li>
            <li>Улучшения качества работы Сервиса;</li>
            <li>Поддержки пользователей и ответа на их запросы;</li>
            <li>
              Обеспечения безопасности и предотвращения мошеннических действий;
            </li>
            <li>Использования чеков в собственных целях.</li>
          </ul>
        </figure>
      </div>
      <div class="text-flex">
        <h3 class="h3">4. Передача данных третьим лицам</h3>
        <figure>
          <figcaption class="figcaption">
            Мы не передаем персональные данные пользователей третьим лицам, за
            исключением следующих случаев:
          </figcaption>
          <ul class="ul">
            <li>
              Если это требуется законодательством или на основании запроса
              государственных органов;
            </li>
            <li>В случае выявления нарушений условий использования Сервиса;</li>
            <li>
              Для обеспечения технического функционирования Сервиса с
              привлечением доверенных партнеров (например, облачных
              хостинг-провайдеров).
            </li>
          </ul>
        </figure>
      </div>
      <div class="text-flex">
        <h3 class="h3">5. Хранение и защита данных</h3>
        <p>
          Мы принимаем все необходимые меры для защиты данных пользователей от
          утечки, несанкционированного доступа, изменения или уничтожения.
          Хранение данных осуществляется на серверах с использованием
          современных технологий защиты.
        </p>
        <p>
          Срок хранения данных ограничен необходимостью их обработки и
          предоставления услуг пользователю. После достижения целей обработки
          данные могут быть анонимизированы или удалены.
        </p>
      </div>
      <div class="text-flex">
        <h3 class="h3">6. Права пользователей</h3>
        <figure>
          <figcaption class="figcaption">Пользователи имеют право:</figcaption>
          <ul class="ul">
            <li>Получать информацию о своих данных, хранящихся в Сервисе;</li>
            <li>Требовать исправления или удаления своих данных;</li>
            <li>Ограничивать обработку своих данных;</li>
            <li>Отозвать согласие на обработку персональных данных.</li>
          </ul>
        </figure>
        <p>
          Для реализации своих прав пользователь может обратиться в службу
          поддержки через контактные данные, указанные в Сервисе.
        </p>
      </div>
      <div class="text-flex">
        <h3 class="h3">7. Изменения в Политике</h3>
        <p>
          Мы оставляем за собой право изменять настоящую Политику в любое время.
          Обновленная версия будет опубликована на данной странице с указанием
          даты последнего обновления.
        </p>
        <p>Дата последнего обновления: 19.02.2025</p>
      </div>
      <div class="text-flex">
        <h3 class="h3">8. Контактные данные</h3>
        <p>
          Если у вас есть вопросы по поводу данной Политики или обработки ваших
          данных, свяжитесь с нами по почте
          <a class="text-decoration" :href="`mailto:${SITE_INFO.mail}`">{{
            SITE_INFO.mail
          }}</a>
        </p>
        <p>Спасибо за использование нашего Сервиса!</p>
      </div>
    </div>
  </div>
</template>
